aoc2018.org
:setup:
#+HUGO_BASE_DIR: .
#+HUGO_SECTION: post
#+todo: todo | edit finished
#+PROPERTY: header-args :exports code :results output
:end:
#+title:  Advent of Code 2018
#+author: Piotr Kaznowski
#+date:   2020-01-03

* edit Day 03: No Matter How You Slice It :reduce:update:zipmap:upacking:re_seq:
CLOSED: [2020-01-12 Sun 21:04]
:PROPERTIES:
:EXPORT_FILE_NAME: day03
:EXPORT_HUGO_WEIGHT: 103
:EXPORT_HUGO_CUSTOM_FRONT_MATTER+: :summary "Discovering magic of reduce, update and some syntactic sugars"
:END:
** Puzzle summary
https://adventofcode.com/2018/day/3

Input is a list of strings like ~#1 @ 393,863: 11x29~ representing an elf's "claim" where ~#1~ represents claim's id, ~393,863~ represents points x, y of upper left vertex of a rectangle on the cartesian grid and ~11x29~ indicate width and height of the rectangle.

Our task is to find number of points on the grid covered potentially by the claims (part 1) and find the only one rectangle which does not overlap with others (part 2). 
 
** Descriptions               :noexport:
*** Part 1
The Elves managed to locate the chimney-squeeze prototype fabric for Santa's suit (thanks to someone who helpfully wrote its box IDs on the wall of the warehouse in the middle of the night). Unfortunately, anomalies are still affecting them - nobody can even agree on how to cut the fabric.

The whole piece of fabric they're working on is a very large square - at least 1000 inches on each side.

Each Elf has made a claim about which area of fabric would be ideal for Santa's suit. All claims have an ID and consist of a single rectangle with edges parallel to the edges of the fabric. Each claim's rectangle is defined as follows:

The number of inches between the left edge of the fabric and the left edge of the rectangle.

The number of inches between the top edge of the fabric and the top edge of the rectangle.
The width of the rectangle in inches.
The height of the rectangle in inches.

A claim like #123 @ 3,2: 5x4 means that claim ID 123 specifies a rectangle 3 inches from the left edge, 2 inches from the top edge, 5 inches wide, and 4 inches tall. Visually, it claims the square inches of fabric represented by # (and ignores the square inches of fabric represented by .) in the diagram below:

#+begin_example
...........
...........
...#####...
...#####...
...#####...
...#####...
...........
...........
...........
#+end_example

The problem is that many of the claims overlap, causing two or more claims to cover part of the same areas. For example, consider the following claims:

#+begin_src txt :tangle inputs/day03-ex
#1 @ 1,3: 4x4
#2 @ 3,1: 4x4
#3 @ 5,5: 2x2
#+end_src

Visually, these claim the following areas:

#+begin_example
........
...2222.
...2222.
.11XX22.
.11XX22.
.111133.
.111133.
........
#+end_example

The four square inches marked with X are claimed by both 1 and 2. (Claim 3, while adjacent to the others, does not overlap either of them.)

If the Elves all proceed with their own plans, none of them will have enough fabric. How many square inches of fabric are within two or more claims?
*** Part 2
Amidst the chaos, you notice that exactly one claim doesn't overlap by even a single square inch of fabric with any other claim. If you can somehow draw attention to it, maybe the Elves will be able to make Santa's suit after all!

For example, in the claims above, only claim 3 is intact after all claims are made.

What is the ID of the only claim that doesn't overlap?

** Solution
[[https://gitlab.com/pkaznowski/aoc18/blob/master/src/aoc18/puzzle03.clj][Check full solution in the repo]]

*** Namespace and requirements
Besides of usual input parsing I will use ~difference~ and ~union~ from ~clojure.set~.

#+name: day03_ns
#+begin_src clojure :noweb-ref code03
  (ns aoc18.puzzle03
    (:require [aoc18.utils :refer [input->str]]
              [clojure.set :refer [difference union]]))

#+end_src

#+name: day03_tests
#+begin_src clojure :noweb-ref test03 :exports none
  (ns aoc18.puzzle03-test
    (:require
     [aoc18.puzzle03 :refer :all]
     [clojure.test :refer :all]))

#+end_src

*** Parsing the claim
Claims look like ~#123 @ 3,2: 5x4~ and we are interested only in numbers and their orded. I'll parse each claim and put all numbers into a ~hash-map~ with keys ~:id~, ~:x~, ~:y~, ~:widht~
and ~:height~.

#+begin_src clojure :noweb-ref test03
(deftest parse-claim-test
  (testing "Should return all numbers found in given str ordered by keys in a hash map"
    (is (= {:id 1 :x 393 :y 863 :width 11 :height 29}
           (parse-claim "#1 @ 393,863: 11x29")))))

#+end_src

Since we are interested only in numbers we can easily parse each claim using ~re-seq~ with simple regex ~#\d+~. Then, after converting strings to integers we can zip those numbers with keys of map which we want to create using ~zipmap~ func:

#+name: day03_parse
#+begin_src clojure :noweb-ref code03
  (defn parse-claim
    "Returns a map where keys are claim id, x, y, width and height"
    [claim]
    (->> claim
         (re-seq #"\d+")
         (map #(Integer/parseInt %))
         (zipmap [:id :x :y :width :height])))

#+end_src

*** First attempt
At this point I tried to write a solution using ~loop~ form. As you can see it turned out to be quite long and complex (using three ~recur~ forms and nested ~if~ statements. It worked! But... 

#+name: day03_old
#+begin_src clojure :results output :exports code
  (defn count-overlapping
    "Checks all points covered by rectangle RECT, updating overlapping points and claims"
    [[s c o] rect]
    (loop [[xy & rest] (covered-by rect)
           seen s
           claims c
           overlapping o]
      (let [this (rect :id)
            other (seen xy)]
        (if (empty? xy)
          [seen claims overlapping]
          (if (some? other)
              (if (> (count other) 1)
                (recur rest seen (union claims other #{this}) overlapping)
                (recur rest
                       (assoc seen xy (conj other this))
                       (union claims other #{this})
                       (+ 1 overlapping)))
              (recur rest (conj seen {xy #{this}}) claims overlapping))))))


  (defn solve []
    (let [input (map parse-claim (input->str "day03"))
          [_ overlapping-claims counter] (reduce count-overlapping [{} #{} 0] input)]
      {:part1 counter
       :part2 (first (difference (set (map :id input)) overlapping-claims))}))
#+end_src

... I realized that something is not right since the func returns data which I don't need and does some unnecessary computations storing part of the solution in a separate ~counter~ variable.

So I started to refactor by eliminating what was unnecessary and making the code more modular. I eventually could considerable shorten the ~loop~ form to only one ~recur~ using two short helper funcs: first getting area covered by a rectangle in terms of cartesian coordinates; second used just to update ~hash-map~ of all points ever covered by a claim. 

*** Helper: get area covered by a rectangle
Having all claims transferred to managable data structure I need to get all points in the cartesian grid covered by given claim's rectangle. For example square with coordinates of upper left vertex ~x = 1~, ~y = 1~ and width of 2 covers points ~(1, 1)~, ~(1, 2)~, ~(2, 1)~ and ~(2, 2)~:

#+begin_src clojure :noweb-ref test03
  (deftest covered-by-test
    (testing "Should return a seq of vectors containing x and y positions of a rectangle 
              passed as an arg"
      (is (= '([1 1] [1 2] [2 1] [2 2])
             (covered-by {:id 1 :x 1 :y 1 :width 2 :height 2})))))

#+end_src

# TODO: link syntactic sugar to the Commentary section
Since we need only certain values from a hash-map where we store the data, we may unpack them using some syntactic sugar while passing arguments. Thanks to that I won't have to write ~let~ form to unpack and bind values to temporary variables. Then a simple ~for~ loop will do:

#+name: day03_covered
#+begin_src clojure :noweb-ref code03
  (defn covered-by
    "Returns all points [x y] covered by rectangle RECT"
    [{:keys [x y width height]}]          ; unpack only needed values
    (for [xx (range x (+ x width))
          yy (range y (+ y height))]
      [xx yy]))

#+end_src

*** Helper: update seen points
This func will be used by ~update~ func later. What is worth noting here is argument ~old~
which will be passed automatically by the ~update~ func. The second arg uses unpacking sugar assigning value of the ~:id~ key from map passed as arg to temporary variable ~id~. 
~some?~ returns true if x is not nil, false otherwise.

#+name: day03_update-seen
#+begin_src clojure :noweb-ref code03
  (defn update-seen
    "Take old value and assign to 'id' var value of :id key in passed arg. Magic!"
    [old {id :id}]
    (if (some? old) (conj old id) #{id}))

#+end_src

To see how this should work we have to put the func into the contex of ~update~. I will check both cases of the desired behavior:

#+begin_src clojure :noweb-ref test03
(deftest update-seen-replaces-test
  (testing "Should update old value adding new"
    (let [before {"a" #{1}}
          after (update before "a" update-seen {:id 2})]
      (is (= #{1 2} (get after "a"))))))

(deftest update-seen-creates-test
  (testing "Should create new value because there was none"
    (let [before {}
          after (update before "a" update-seen {:id 3})]
      (is (= #{3} (get after "a"))))))

#+end_src

*** Refactoring with loop
Finally I got this func which could be used with ~redce~ on parsed claims:

#+name: day03_loop
#+begin_src clojure :noweb-ref code03
  (defn loop-overlapping
    "Checks all points covered by rectangle RECT, updating overlapping points and claims"
    [s rect]
    (loop [[xy & rest] (covered-by rect)
           seen s]
      (if (empty? xy)
        seen
        (recur rest (update seen xy update-seen rect)))))

#+end_src

*** Further refactoring with reduce
Then I found a similar solution which was using ~reduce~ instead of ~loop~ which was more convenient because it enabled further slimming down the code and, hmm, reducing more unnecessary data. 

#+name: day03_reduce
#+begin_src clojure :noweb-ref code03
  (defn reduce-overlapping
    "Checks all points covered by rectangle RECT, updating overlapping points and claims"
    [claims]
    (reduce (fn [seen rect]
              ; old is passed automatically?
              (reduce (fn [seen xy] (update seen xy update-seen rect)) 
                      seen (covered-by rect)))
            {} claims))

#+end_src

To compare both funcs we may put them into one test:
 
#+name: day03_loop_and_reduce_test
#+begin_src clojure :noweb-ref test03
(deftest loop-and-reduce-overlapping-test
  (testing "Should return hash map where keys are x, y positions and values are ids of 
            rectangles covering those positions"
    (let [rects [{:id "a" :x 1 :y 1 :width 2 :height 2}
                 {:id "b" :x 2 :y 2 :width 2 :height 2}]
          seen {}
          expected {[1 1] #{"a"}
                    [2 1] #{"a"}
                    [1 2] #{"a"}
                    [2 2] #{"a" "b"}
                    [3 2] #{"b"}
                    [2 3] #{"b"}
                    [3 3] #{"b"}}]
      (is (= expected (reduce loop-overlapping seen rects)))
      (is (= expected (reduce-overlapping rects))))))

#+end_src

*** Putting things together
#+name: day03_solve
#+begin_src clojure :noweb-ref code03
  (defn solve
    "First we parse  input data with regexes  making seq of vectors  mapped with appripriate
    keys.
    Funcs `reduce-overlapping' and `loop-overlapping' return dict where keys are positions
    on the xy grid and values are sets of rectangle ids.
    Part 1: to get all overlap positions we have to find all points which are claimed at
    least by two rectangles.
    Part 2: to find the one exclusively non overlapping rectangle we have to find difference
    between all ids and the set of ids of all points which are claimed by more than one
    rectangle."
    [file]
    (let [input (map parse-claim (input->str file))
          ;; claims (vals (reduce loop-overlapping {} input))
          claims (time (vals (reduce-overlapping input)))]
      {:part1 (time (->> claims
                         (map count)
                         (filter #(>= % 2))
                         count))
       :part2 (time (first
                     (difference
                      (->> input (map :id) set)
                      (->> claims
                           (filter #(> (count %) 1))
                           (apply union)))))}))

#+end_src

Let's check if this works for exemplary data:

#+begin_src clojure :noweb-ref test03
  (deftest example-test
    (testing "should return 4 for the first part and 3 for the second "
      (is (= {:part1 4 :part2 3}
             (solve "day03-ex")))))
#+end_src

#+name: day03_tangle
#+begin_src clojure :noweb yes :tangle src/aoc18/puzzle03.clj :exports none :results silent
  <<code03>>
#+end_src

Run tests:
#+name: day03_tests_tangle
#+begin_src clojure :noweb yes :tangle test/aoc18/puzzle03_test.clj :exports none :results silent
  <<test03>>
#+end_src

#+name: day03_tests
#+begin_src clojure :results output :exports results
  (require '[clojure.test :refer [run-tests]] 'aoc18.puzzle03-test)
  (run-tests 'aoc18.puzzle03-test)
#+end_src

#+RESULTS: day03_tests
: 
: Testing aoc18.puzzle03-test
: "Elapsed time: 0.436003 msecs"
: "Elapsed time: 0.040985 msecs"
: "Elapsed time: 0.099504 msecs"
: 
: Ran 6 tests containing 7 assertions.
: 0 failures, 0 errors.

Get the answer:

#+name: day03_result
#+begin_src clojure :ns aoc18.puzzle03 :exports results :results code
  (solve "day03")
#+end_src

#+RESULTS: day03_result
#+begin_src clojure
"Elapsed time: 1389.891323 msecs"
"Elapsed time: 294.721887 msecs"
"Elapsed time: 300.97284 msecs"
{:part1 98005, :part2 331}
#+end_src

** COMMENT Commentary
- [ ] re-seq
- [ ] zip-map
- [ ] {:keys [x y etc]} → syntactic sugar
